БИТУправление_медицинским_центром_демо/src/Documents/СписаниеТоваров/СписаниеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеТоваров</name>
  <basedOn>Document.ИнвентаризацияТоваров</basedOn>
  <basedOn>Document.ПеремещениеМатериалов</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.АвансовыйОтчет</basedOn>
  <registerRecords>InformationRegister.СписанныеТовары</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПеремещениеМатериалов</types>
      <types>DocumentRef.ИнвентаризацияТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтнесеноНаЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияВыработки</name>
      <type>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПолучатель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/ПартииТоваровНаСкладах/ПартииТоваровНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПартииТоваровНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОприходования</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ОказаниеУслуг</types>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.АвансовыйОтчет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/СписаниеТоваров/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает доступные варианты печати документа.
//  Результатом является Струткура, каждая строка которой соответствует одному из вариантов печати.
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("Ведомость","Акт списания товаров");
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура формирует печатную форму документа
//  Название макета печати передается в качестве параметра,
//  по переданному имени макета определяется соответствующая функция печати.
//
// Параметры:
//  СсылкаНаОбъект	 - ДокументСсылка	 - ссылка на распечатываемый документ.
//  ИмяМакета		 - Строка			 - имя макета из структуры печатных форм.
// 
// Возвращаемое значение:
//  ТабличныйДокумент.
//
Функция Печать(СсылкаНаОбъект, ИмяМакета) Экспорт
	
	Перем ТабДокумент;
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "Ведомость" Тогда
		
		// Печать упр. формы документа
		ТабДокумент = ПечатьСписаниеТоваров(СсылкаНаОбъект);
	КонецЕсли;
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьСписаниеТоваров(СсылкаНаОбъект)
	
	ПараметрыПечати = ПолучитьДанныеДляПечатиСписанияТоваров(СсылкаНаОбъект);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеТоваров_Накладная";
	
	Макет = ПолучитьМакет("Накладная");
	
	// Выводим шапку накладной
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок|Основная");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);
	
	Если ПараметрыПечати.РазличныеСклады Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок|Склад");
		ТабДокумент.Присоединить(ОбластьМакета);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("СкладСписания");
		ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	ОбластьШапка  = Макет.ПолучитьОбласть("ШапкаТаблицы|Основная");
	ОбластьШапка.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьШапка);
	
	Если ПараметрыПечати.РазличныеСклады Тогда
		ОбластьСклад = Макет.ПолучитьОбласть("ШапкаТаблицы|Склад");
		ТабДокумент.Присоединить(ОбластьСклад);
	КонецЕсли;
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка|Основная");
	СуммаИтого = 0;
	Ном        = 0;
	
	Если ПараметрыПечати.РазличныеСклады Тогда
		ОбластьСклад = Макет.ПолучитьОбласть("Строка|Склад");
	КонецЕсли;

	Для Каждого ПараметрыПозиции Из ПараметрыПечати.Позиции Цикл
		
		Если Не ЗначениеЗаполнено(ПараметрыПозиции.Номенклатура) Тогда
			ТекстСообщения = НСтр("ru='В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		
		ОбластьСтрока.Параметры.Заполнить(ПараметрыПозиции);
		ТабДокумент.Вывести(ОбластьСтрока);
		
		Если ПараметрыПечати.РазличныеСклады Тогда
			ОбластьСклад.Параметры.Заполнить(ПараметрыПозиции);
			ТабДокумент.Присоединить(ОбластьСклад);
		КонецЕсли;	

	КонецЦикла;
	
	// Вывести Итого
	ОбластьИтого = Макет.ПолучитьОбласть("Итого|Основная");
	ОбластьИтого.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьИтого);
	
	Если ПараметрыПечати.РазличныеСклады Тогда
		ОбластьСклад = Макет.ПолучитьОбласть("Итого|Склад");
	КонецЕсли;	
	
	Если ПараметрыПечати.РазличныеСклады Тогда
		ОбластьСклад.Параметры.Заполнить(ПараметрыПечати);
		ТабДокумент.Присоединить(ОбластьСклад);
	КонецЕсли;	
	
	// Вывести Сумму прописью
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Вывести подписи
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи|Основная");
	ТабДокумент.Вывести(ОбластьМакета);
	
	Если ПараметрыПечати.РазличныеСклады Тогда 	
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи|Склад");
		ТабДокумент.Присоединить(ОбластьМакета);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьСписаниеТоваров()

Функция ПолучитьДанныеДляПечатиСписанияТоваров(СсылкаНаОбъект)
	
	ПараметрыПечати = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеТоваров.Номер КАК Номер,
	|	СписаниеТоваров.Дата КАК Дата,
	|	СписаниеТоваров.Склад КАК Склад,
	|	СписаниеТоваров.Склад.Представление КАК ПредставлениеСклада,
	|	СписаниеТоваров.Товары.(
	|		Номенклатура КАК Номенклатура,
	|		Номенклатура.НаименованиеПолное КАК Товар,
	|		Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕХО,
	|		Номенклатура.Артикул КАК Артикул,
	|		Количество КАК Количество,
	|		ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|		ХарактеристикаНоменклатуры КАК Характеристика,
	|		Коэффициент КАК Коэффициент,
	|		Склад КАК СкладСтрока
	|	) КАК Товары
	|ИЗ
	|	Документ.СписаниеТоваров КАК СписаниеТоваров
	|ГДЕ
	|	СписаниеТоваров.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписаниеТоваров.Товары.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СписаниеТоваровТовары.Склад) КАК СкладРазличные
	|ИЗ
	|	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеТоваров КАК СписаниеТоваров
	|		ПО СписаниеТоваровТовары.Ссылка = СписаниеТоваров.Ссылка
	|			И (СписаниеТоваровТовары.Ссылка = &ТекущийДокумент)
	|			И (СписаниеТоваров.Ссылка = &ТекущийДокумент)
	|			И СписаниеТоваровТовары.Склад <> СписаниеТоваров.Склад
	|			И (СписаниеТоваровТовары.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))";
	
	ВалютаПечати = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ВалютаУчета");
	ТаблицаСтоимости = ПолучитьТаблицуСтоимостиТоваров(СсылкаНаОбъект);
	ТаблицаСтоимости.Индексы.Добавить("Номенклатура,Характеристика");
	
	Выборка = Запрос.ВыполнитьПакет();
	Шапка = Выборка[0].Выбрать();
	СкладРазличные = Выборка[1].Выбрать();
	Шапка.Следующий();
	СкладРазличные.Следующий();
	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
	
	ПараметрыПечати.Вставить("Склад", Шапка.Склад);
	Если СкладРазличные.СкладРазличные > 0 Тогда
		ПараметрыПечати.Вставить("РазличныеСклады", Истина);
	Иначе
		ПараметрыПечати.Вставить("РазличныеСклады", Ложь);
	КонецЕсли;	

	// Выводим шапку накладной
	ТекстНазваниеДокумента = НСтр("ru='Списание товаров'"); 
	ПараметрыПечати.Вставить("ТекстЗаголовка", ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, ТекстНазваниеДокумента));
	ПараметрыПечати.Вставить("ПредставлениеСклада", Шапка.ПредставлениеСклада);
	КраткоеНаименованиеВалюты = ОбщегоНазначения.ПолучитьКраткоеНаименованиеОсновнойВалюты();
	ТекстИтогоВалюта = НСтр("ru='Всего (%1):'");
	ТекстИтогоВалюта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстИтогоВалюта, КраткоеНаименованиеВалюты); 
	ПараметрыПечати.Вставить("ИтогоВалюта", ТекстИтогоВалюта);
	ТекстАртикул = НСтр("ru='Артикул'"); 
	ПараметрыПечати.Вставить("ИмяКолонкиКодов", ТекстАртикул);
	
	Позиции = Новый Массив;
	СуммаИтого = 0;
	Ном        = 0;
	
	// Товары
	Пока ВыборкаСтрокТовары.Следующий() Цикл
		
		ПараметрыПозиции = Новый Структура;
		ПараметрыПозиции.Вставить("Номенклатура", ВыборкаСтрокТовары.Номенклатура);
		Ном = Ном + 1;
		
		ПараметрыПозиции.Вставить("НомерСтроки", Ном);
		ПараметрыПозиции.Вставить("Артикул", ВыборкаСтрокТовары.Артикул);
		
		Если Не ВыборкаСтрокТовары.Характеристика.Наименование = "" Тогда
			ПараметрыПозиции.Вставить("Товар", ВыборкаСтрокТовары.Товар + Символы.ПС +"(" +ВыборкаСтрокТовары.Характеристика.Наименование + ")" );
		Иначе
			ПараметрыПозиции.Вставить("Товар", ВыборкаСтрокТовары.Товар)
		КонецЕсли;	
		
		ПараметрыПозиции.Вставить("Количество", ВыборкаСтрокТовары.Количество);
		ПараметрыПозиции.Вставить("ЕдиницаИзмерения", ВыборкаСтрокТовары.ЕдиницаИзмерения);
		Сумма = ПолучитьСтоимостьТовара(ТаблицаСтоимости, ВыборкаСтрокТовары);
		ПараметрыПозиции.Вставить("Сумма", ОбщегоНазначенияКлиентСервер.ФорматСумм(Сумма));
		
		СуммаИтого = СуммаИтого + Сумма;

		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.СкладСтрока) Тогда
			ПараметрыПозиции.Вставить("СкладСтрока", Шапка.Склад);
		Иначе
			ПараметрыПозиции.Вставить("СкладСтрока", ВыборкаСтрокТовары.СкладСтрока);
		КонецЕсли;
		
		Позиции.Добавить(ПараметрыПозиции);
		
	КонецЦикла;
	
	ПараметрыПечати.Вставить("Позиции", Позиции);
	
	ПараметрыПечати.Вставить("Всего", ОбщегоНазначенияКлиентСервер.ФорматСумм(СуммаИтого));
	
	// Вывести Сумму прописью
	ТекстСтроки = НСтр("ru='Всего наименований %1, на сумму %2'");
	ТекстСтроки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСтроки, Ном, ОбщегоНазначенияКлиентСервер.ФорматСумм(СуммаИтого, ВалютаПечати)); 
	ПараметрыПечати.Вставить("ИтоговаяСтрока", ТекстСтроки);
	ПараметрыПечати.Вставить("СуммаПрописью", ОбщегоНазначения.СформироватьСуммуПрописью(СуммаИтого, ВалютаПечати));
	
	Возврат ПараметрыПечати;
	
КонецФункции

Функция ПолучитьТаблицуСтоимостиТоваров(СсылкаНаОбъект)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПартииТоваровНаСкладах.Номенклатура               КАК Номенклатура,
	|	ПартииТоваровНаСкладах.ХарактеристикаНоменклатуры КАК Характеристика,
	|	СУММА(ПартииТоваровНаСкладах.Количество)          КАК Количество,
	|	СУММА(ПартииТоваровНаСкладах.Сумма)           КАК Стоимость
	|ИЗ
	|	РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	|
	|ГДЕ
	|	ПартииТоваровНаСкладах.Регистратор = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровНаСкладах.Номенклатура,
	|	ПартииТоваровНаСкладах.ХарактеристикаНоменклатуры
	|";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьСтоимостьПоПартиямТоваров()

Функция ПолучитьСтоимостьТовара(Таблица, ТекСтрока)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура",   ТекСтрока.Номенклатура);
	СтруктураПоиска.Вставить("Характеристика", ТекСтрока.Характеристика);
	
	НаборСтрок = Таблица.НайтиСтроки(СтруктураПоиска);
	Если ТекСтрока.КоэффициентЕХО = 0 Тогда
		КолСписать = ТекСтрока.Количество;// * ТекСтрока.Коэффициент;
	Иначе
		КолСписать = ТекСтрока.Количество * ТекСтрока.Коэффициент / ТекСтрока.КоэффициентЕХО;
	КонецЕсли;
	Стоимость  = 0;
	
	Для Каждого Строка Из НаборСтрок Цикл
		Если КолСписать >= Строка.Количество Тогда
			Стоимость         = Стоимость  + Строка.Стоимость;
			КолСписать        = КолСписать - Строка.Количество;
			Строка.Стоимость  = 0;
			Строка.Количество = 0;
		Иначе
			Если Не Строка.Количество = 0 Тогда
				СумСписать        = Окр(Строка.Стоимость * КолСписать / Строка.Количество, 2, 1);
				Стоимость         = Стоимость + СумСписать;
				Строка.Стоимость  = Строка.Стоимость  - СумСписать;
				Строка.Количество = Строка.Количество - КолСписать;
			Иначе
				Стоимость        = Стоимость + Строка.Стоимость;
				Строка.Стоимость = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Стоимость;
	
КонецФункции // ПолучитьСтоимостьПоПартиямТоваров()

#КонецОбласти
